fbiego/esp32-c3-mini/hal/esp32/app_hal.cpp
  lv_obj_scroll_to_y(ui_settingsList, 1, LV_ANIM_ON);
  lv_obj_scroll_to_y(ui_appList, 1, LV_ANIM_ON);
  lv_obj_scroll_to_y(ui_appInfoPanel, 1, LV_ANIM_ON);
  lv_obj_scroll_to_y(ui_gameList, 1, LV_ANIM_ON);

  if (tm > 4)
  {
    tm = 4;
  }
  else if (tm < 0)
  {
    tm = 0;
  }

  tft.setBrightness(br);

  lv_dropdown_set_selected(ui_timeoutSelect, tm);
  lv_slider_set_value(ui_brightnessSlider, br, LV_ANIM_OFF);
  if (circular)
  {
    lv_obj_add_state(ui_Switch2, LV_STATE_CHECKED);
  }
  else
  {
    lv_obj_clear_state(ui_Switch2, LV_STATE_CHECKED);
  }
  if (alertSwitch)
  {
    lv_obj_add_state(ui_alertStateSwitch, LV_STATE_CHECKED);
  }
  else
  {
    lv_obj_clear_state(ui_alertStateSwitch, LV_STATE_CHECKED);
  }

  screenTimer.active = true;
  screenTimer.time = millis();

  setTimeout(tm);

  Timber.i("Setup done");
  Timber.i(about);
}

void hal_loop()
{

  lv_timer_handler(); /* let the GUI do its work */

  if (gameActive)
  {
    // run only game in loop?
    // ui_games_update(); // not smooth, use separate task instead. see gameLoop()
  }
  else
  {
    // skip when game running
    delay(5);
    watch.loop();

    if (ui_home == ui_clockScreen)
    {
      lv_label_set_text(ui_hourLabel, watch.getHourZ().c_str());
      lv_label_set_text(ui_dayLabel, watch.getTime("%A").c_str());
      lv_label_set_text(ui_minuteLabel, watch.getTime("%M").c_str());
      lv_label_set_text(ui_dateLabel, watch.getTime("%d\n%B").c_str());
      lv_label_set_text(ui_amPmLabel, watch.getAmPmC(false).c_str());
    }
    else
    {
      update_faces();
    }

    lv_disp_t *display = lv_disp_get_default();
    lv_obj_t *actScr = lv_disp_get_scr_act(display);
    if (actScr != ui_home)
    {
    }

    if (actScr == ui_appInfoScreen)
    {
      lv_label_set_text_fmt(ui_appBatteryText, "Battery - %d%%", watch.getPhoneBattery());
      lv_bar_set_value(ui_appBatteryLevel, watch.getPhoneBattery(), LV_ANIM_OFF);
      if (watch.isPhoneCharging())
      {
        lv_img_set_src(ui_appBatteryIcon, &ui_img_battery_plugged_png);
      }
      else
      {
        lv_img_set_src(ui_appBatteryIcon, &ui_img_battery_state_png);
      }
    }

    if (alertTimer.active)
    {
      if (alertTimer.time + alertTimer.duration < millis())
      {
        alertTimer.active = false;
        lv_obj_add_flag(ui_alertPanel, LV_OBJ_FLAG_HIDDEN);
      }
    }

    if (screenTimer.active)
    {
      uint8_t lvl = lv_slider_get_value(ui_brightnessSlider);
      tft.setBrightness(lvl);

      if (screenTimer.duration < 0)
      {
        // Timber.w("Always On active");
        screenTimer.active = false;
      }
      else if (watch.isCameraReady())
      {
        screenTimer.active = false;
      }
      else if (screenTimer.time + screenTimer.duration < millis())
      {
        Timber.w("Screen timeout");
        screenTimer.active = false;

        tft.setBrightness(0);
        lv_disp_load_scr(ui_home);
      }
    }
  }
}

bool isDay()
{
  return watch.getHour(true) > 7 && watch.getHour(true) < 21;
}

void update_faces()
{
  int second = watch.getSecond();
  int minute = watch.getMinute();
  int hour = watch.getHourC();
  bool mode = watch.is24Hour();
  bool am = watch.getHour(true) < 12;
  int day = watch.getDay();
  int month = watch.getMonth() + 1;
  int year = watch.getYear();
  int weekday = watch.getDayofWeek();

  int temp = watch.getWeatherAt(0).temp;
  int icon = watch.getWeatherAt(0).icon;

  int battery = watch.getPhoneBattery();
  bool connection = watch.isConnected();

  int steps = 2735;
  int distance = 17;
  int kcal = 348;
  int bpm = 76;
  int oxygen = 97;

  ui_update_watchfaces(second, minute, hour, mode, am, day, month, year, weekday,
                       temp, icon, battery, connection, steps, distance, kcal, bpm, oxygen);
}
